<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<title>Configurer une cam&eacute;ra CCD et acqu&eacute;rir des images</title>
</head>

<body>

  <p>L'acquisition des images est la partie fondamentale de l'imagerie CCD. Il est possible d'acqu&eacute;rir des images de diff&eacute;rentes mani&egrave;res. De toute fa&ccedil;on, il est primordial de r&eacute;ussir les images lors de l'acquisition. La croyance qui consiste &agrave; penser que l'on peut rattraper tous les d&eacute;fauts avec le traitement d'image est fausse. Quelques conseils de base permettent d'&eacute;viter les &eacute;cueils.</p>
  <p>Nous aborderons la technique de prise de vue pour une image individuelle, puis nous d&eacute;crirons la focalisation, &eacute;tape incontournable en d&eacute;but de nuit. Enfin, nous verrons comment acqu&eacute;rir des s&eacute;ries d'images et nous finirons en d&eacute;crivant la technique d'acquisition en mode drift scan.</p>

	<h3> 1. Configuration de la cam&eacute;ra CCD</h3>
  <p>Pour r&eacute;gler les param&egrave;tres de connexion d'une cam&eacute;ra CCD, il faut ouvrir la fen&ecirc;tre de configuration des cam&eacute;ras. Pour cela, vous devez aller dans le menu d&eacute;roulant R&eacute;glages, puis cliquer sur Cam&eacute;ra :</p>
  <p align="center"><img src="images/interfa2/interfa2-01-fr.jpg" height="118" width="638" alt="" />
  <p>La fen&ecirc;tre de configuration des cam&eacute;ras se pr&eacute;sente sous la forme ci-dessous :</p>
  <p align="center"><img src="images/interfa2/interfa2-02-fr.jpg" height="355" width="506" alt="" /></p>
  <p>Vous pouvez constater qu'Audace supporte un certain nombre de cam&eacute;ras CCD, il vous suffit de cliquer sur les diff&eacute;rents onglets disponibles (Hi-SIS, ST7, CB245, MX5, Kitty et WebCam) pour explorer les possibilit&eacute;s de pilotage de cam&eacute;ras par le logiciel. Nous allons d&eacute;velopper la pr&eacute;sente page sur l'exemple de la cam&eacute;ra CCD Audine, pour les autres cam&eacute;ras cela ne doit gu&egrave;re &ecirc;tre diff&eacute;rent, sauf pour la WebCam dont le cas est trait&eacute; &agrave; la fin de cette page.</p>
  <p>Tout d'abord, il vous faut d&eacute;finir le Port que vous allez utiliser pour piloter votre cam&eacute;ra CCD. Actuellement, la quasi totalit&eacute; des cam&eacute;ras CCD se connectent sur le port parall&egrave;le de votre micro ordinateur, vous devez donc choisir entre lpt1 et lpt2 en utilisant</p>
  <p align="center"><img src="images/interfa2/interfa2-03-fr.jpg" height="21" width="20" alt="" /></p>
  <p>De m&ecirc;me, vous devez choisir le CCD (Format CCD) qui &eacute;quipe votre cam&eacute;ra Audine, l&agrave; votre choix peut se faire entre kaf400, kaf1600 ou kaf3200, toujours en utilisant</p>
  <p align="center"><img src="images/interfa2/interfa2-03-fr.jpg" height="21" width="20" alt="" /> et le bouton gauche de votre souris. Pour votre information, il s'agit de capteurs CCD fabriqu&eacute;s par la firme Kodak. Le capteur Kaf-0400 poss&egrave;de 768 lignes et 512 colonnes constitu&eacute;es de pixels de 9 microns de cot&eacute;, ce qui lui donne une surface sensible &eacute;gale &agrave; 6,9 mm par 4,6 mm. Le Kaf-1600 a pour sa part 1536 lignes et 1024 colonnes avec &eacute;galement des pixels de 9 microns de cot&eacute;, soit une surface sensible 4 fois plus importante que le Kaf-0400, donc &eacute;gale &agrave; 13,8 mm par 9,2 mm. Enfin, le Kaf-3200 poss&egrave;de quant &agrave; lui 2184 lignes et 1472 colonnes avec cette fois des pixels de 6,8 microns de cot&eacute;, donc sa surface sensible est de 14,8 mm par 10,3 mm (sensiblement plus grande que celle du Kaf-1600).</p>
  <p>Il convient de d&eacute;finir &agrave; ce stade si vous souhaitez acqu&eacute;rir une image avec un miroir en x (Miroir X) et/ou un miroir en y (Miroir Y) en cochant ou non la case qui pr&eacute;c&egrave;de chacun des 2 libell&eacute;s. Ces 2 options sont l&agrave; pour vous permettre d'orienter, sur l'&eacute;cran de votre micro ordinateur, l'image que vous allez acqu&eacute;rir selon votre go&ucirc;t personnel et/ou selon la configuration optique que vous utilisez (renvoi coud&eacute;, barlow, projection par oculaire, etc.).</p>
  <p>Si votre Audine poss&egrave;de un obturateur, c'est maintenant qu'il faut le configurer. Vous devez choisir son type (Type de l'obturateur) et son mode fonctionnement (Fonctionnement de l'obturateur).</p>
  <p>Pour le type de l'obturateur, les choix possibles par</p>
  <p align="center"><img src="images/interfa2/interfa2-03-fr.jpg" height="21" width="20" alt="" /></p>
	<p> sont :</p>
  <ul>
    <li> audine</li>
    <li> audine -</li>
    <li> thierry</li>
  </ul>
  <p>Ces diff&eacute;rents modes permettent la commande d'obturateurs d&eacute;velopp&eacute;s pour les utilisateurs eux-m&ecirc;mes. Ainsi, audine et audine - sont essentiellement destin&eacute;s &agrave; la commande d'obturateurs &agrave; base d'&eacute;lectro-aimant, ou d'obturateurs r&eacute;cup&eacute;r&eacute;s dans des cam&eacute;scopes. La fonctionnalit&eacute; audine - est le compl&eacute;ment en fonctionnement &eacute;lectrique du choix audine. Donc selon que votre obturateur doit &ecirc;tre command&eacute; par une impulsion positive ou une mise &agrave; la masse, vous devez choisir l'une ou l'autre de ces 2 options. La s&eacute;lection thierry ouvre le choix vers un obturateur command&eacute; par un servo-moteur de mod&eacute;lisme, nous ne d&eacute;sesp&eacute;rons pas que Pierre Thierry qui a mis au point cet obturateur consacre un jour un peu de son temps pour le d&eacute;crire sur un site web. En attendant, cette possibilit&eacute; risque de ne conna&icirc;tre que lui comme utilisateur.</p>
  <p>En ce qui concerne le mode de fonctionnement, vous avez le choix entre Ouvert, Ferm&eacute; ou Synchro toujours par action sur</p>
  <p align="center"><img src="images/interfa2/interfa2-03-fr.jpg" height="21" width="20" alt="" />. Si vous choisissez Ouvert, votre obturateur restera constamment en position Ouvert quelque soit le mode d'acquisition choisi. Le choix Ferm&eacute; est principalement destin&eacute; &agrave; l'acquisition d'images de bias ou de dark, pour plus de d&eacute;tails nous vous invitons &agrave; lire le chapitre concernant <a href="interfa3.htm">le traitement des images CCD</a>. Dans ce cas l'obturateur est toujours Ferm&eacute; pendant les acquisitions. Enfin le choix Synchro rend votre obturateur synchrone avec l'acquisition des images CCD, c'est &agrave; dire qu'il s'ouvrira en d&eacute;but de pose et qu'il se fermera &agrave; la fin juste avant de commencer la phase de lecture du CCD.</p>
  <p>Vous remarquez &eacute;galement la pr&eacute;sence d'une adresse web, pour notre exemple <a href="http://www.astrosurf.com/audine/index_fr.htm">http://www.astrosurf.com/audine/index_fr.htm</a> sous le libell&eacute; Site Web de r&eacute;f&eacute;rence. Il s'agit d'un lien hypertexte qui vous connecte via Internet au site web d&eacute;di&eacute; au mat&eacute;riel concern&eacute;, si bien s&ucirc;r vous avez pris le temps de correctement configurer Audace : R&eacute;glages --> Configuration --> Editeurs. Toutes les cam&eacute;ras du panneau de configuration ont ce type de lien hypertexte, c'est bien utile pour ceux qui d&eacute;sirent conna&icirc;tre un peu mieux les diff&eacute;rents types de mat&eacute;riel support&eacute;s.</p>
  <p>La configuration de votre cam&eacute;ra est termin&eacute;e. Une autre option (cr&eacute;ation automatique de la connexion de la cam&eacute;ra avec Audace au d&eacute;marrage) est possible, elle est d&eacute;crite plus loin.</p>
  <p>Apr&egrave;s avoir rempli les diff&eacute;rents champs avec les param&egrave;tres correspondants &agrave; votre cam&eacute;ra, vous devez la connecter &agrave; Audace. Pour cela il vous suffit tout simplement d'appuyer sur le bouton Appliquer (ou OK). Un appui sur le bouton Appliquer vous donne l'&eacute;cran suivant :</p>
  <p align="center"><img src="images/interfa2/interfa2-04-fr.jpg" height="355" width="506" alt="" />
  <p>Vous remarquez que la seule diff&eacute;rence de ce panneau avec le pr&eacute;c&eacute;dent r&eacute;side dans le graphisme du bouton Tests pour la fabrication de la cam&eacute;ra. En effet, sur le pr&eacute;c&eacute;dent panneau, ce libell&eacute; &eacute;tait en gris&eacute; et le bouton &eacute;tait non actif, alors qu'apr&egrave;s la connexion de la cam&eacute;ra ce libell&eacute; est devenu noir et le bouton est d&eacute;sormais actif. C'est un mode de fonctionnement courant dans le panneau de configuration des cam&eacute;ras (mais &eacute;galement pour celui des t&eacute;lescopes, nous verrons cela plus tard), les boutons ne sont actifs que lorsque la cam&eacute;ra est connect&eacute;e.</p>
  <p>De plus un message vient de s'inscrire dans la Console. C'est la confirmation que votre cam&eacute;ra Audine, &eacute;quip&eacute;e d'un capteur Kaf-0400, est bien connect&eacute;e au port parall&egrave;le lpt1.</p>
  <p align="center"><img src="images/interfa2/interfa2-05-fr.jpg" height="254" width="337" alt="" /></p>
  <p>Mais ce n'est pas tout, la connexion de la cam&eacute;ra Audine vient de g&eacute;n&eacute;rer une modification dans la fen&ecirc;tre principale d'Audace qui passe de :</p>
  <p align="center"><img src="images/interfa2/interfa2-06-fr.jpg" height="90" width="638" alt="" /> &agrave; :</p>
  <p align="center"><img src="images/interfa2/interfa2-07-fr.jpg" height="90" width="637" alt="" /></p>
  <p>Vous remarquez que le nom de la cam&eacute;ra connect&eacute;e &agrave; Audace est venu s'inscrire en bas &agrave; droite de la capture d'&eacute;cran, juste apr&egrave;s Cam&eacute;ra, dans notre cas c'est audine.</p>
  <p>N'oubliez pas, lorsque vous avez correctement configur&eacute; les diff&eacute;rents param&egrave;tres de votre cam&eacute;ra, qu'il faut les valider en appuyant sur le bouton Appliquer ou OK. Ensuite &agrave; la fermeture du logiciel, celui-ci vous demandera d'enregistrer votre nouvelle configuration. Lors d'une prochaine cession d'observation, la cam&eacute;ra sera ainsi d&eacute;j&agrave; configur&eacute;e.</p>
  <p>Pour information seulement, nous allons revenir un instant sur les fonctionnalit&eacute;s disponibles gr&acirc;ce &agrave; l'appui sur le bouton Tests pour la fabrication de la cam&eacute;ra. Tout appui sur ce bouton g&eacute;n&egrave;re l'ouverture de la fen&ecirc;tre suivante :</p>
  <p align="center"><img src="images/interfa2/interfa2-08-fr.jpg" height="261" width="452" alt="" /></p>
  <p>Les diff&eacute;rents boutons disponibles sur cette fen&ecirc;tre (Set 0, Set 255, Test et Test 2) permettent le r&eacute;glage de la cam&eacute;ra Audine pendant sa fabrication, ou son d&eacute;pannage en cas d'anomalie de fonctionnement. Le but de cette page n'&eacute;tant pas la fabrication d'une cam&eacute;ra, nous ne d&eacute;taillons pas l'utilisation de ce panneau. Mais si vous &ecirc;tes en train de construire votre Audine, sachez qu'Audace permet de tester la cam&eacute;ra aux diff&eacute;rents stades de sa fabrication. La documentation disponible pour la fabrication d'une Audine vous guide dans le choix des diff&eacute;rents boutons.</p>
  <p>Avant de cl&ocirc;turer ce paragraphe, revenons &agrave; une fonctionnalit&eacute; du panneau Configuration de la cam&eacute;ra. Dans la partie inf&eacute;rieure de ce panneau (voir ci-dessous), vous constatez la pr&eacute;sence du message suivant : Cr&eacute;er au d&eacute;marrage (pour &eacute;viter de reconfigurer &agrave; chaque fois).</p>
  <p align="center"><img src="images/interfa2/interfa2-09-fr.jpg" height="125" width="505" alt="" /></p>
  <p>Si apr&egrave;s avoir coch&eacute; cette case, vous appuyez sur le bouton Appliquer (ou OK), &agrave; la fermeture du logiciel, celui-ci vous demandera d'enregistrer votre nouvelle configuration. Au prochain d&eacute;marrage d'Audace, vous n'aurez pas &agrave; reconfigurer votre cam&eacute;ra. La diff&eacute;rence, c'est qu'avec cette option, la cam&eacute;ra Audine se connecte automatiquement avec Audace en utilisant le param&eacute;trage pr&eacute;c&eacute;demment d&eacute;fini. Vous pouvez v&eacute;rifier ceci en notant apr&egrave;s l'ouverture d'Aude'ACE la pr&eacute;sence de audine en face de Cam&eacute;ra dans la partie inf&eacute;rieure droite de la fen&ecirc;tre principale. Cette option est int&eacute;ressante pour la plupart des utilisateurs car ils ne poss&egrave;dent g&eacute;n&eacute;ralement qu'une seule cam&eacute;ra CCD, elle leur &eacute;conomise quelques manipulations dans les menus.</p>

	<h3 id="acq">2. Acquisition d'une image</h3>
  <p>Pour faire l'acquisition d'une image, il faut s&eacute;lectionner le panneau Acquisition. Pour cela, vous devez ouvrir le menu d&eacute;roulant Panneau, puis cliquer sur Acquisition, voici ce que vous obtenez &agrave; l'&eacute;cran :</p>
  <p align="center"><img src="images/interfa2/interfa2-10-fr.jpg" height="347" width="637" alt="" /></p>
  <p>Ce panneau sert &agrave; r&eacute;gler les param&egrave;tres d'acquisition de l'image (temps de pose ou d'Exposition, la D&eacute;finition et le Nom de l'image), &agrave; lancer la pose, &agrave; arr&ecirc;ter la pose en cours et enfin &agrave; enregistrer l'image sur votre disque dur. Les champs &agrave; renseigner sont de couleur orange. Il a la forme suivante :</p>
  <p align="center"><img src="images/interfa2/interfa2-11-fr.jpg" height="498" width="638" alt="" /></p>
  <p>Le r&eacute;glage du temps d'Exposition correspond au temps de pose, encore appel&eacute; temps d'int&eacute;gration. Il doit &ecirc;tre exprim&eacute; en secondes. La D&eacute;finition de l'image consiste &agrave; choisir le mode de rassemblement des pixels sur la matrice du CCD. La Haute d&eacute;finition consiste &agrave; convertir un pixel du composant CCD en un pixel dans l'image finale (ce mode est &eacute;galement appel&eacute; binning 1x1). La Moyenne d&eacute;finition consiste &agrave; rassembler les pixels du composant CCD par paquets de quatre dans l'image finale (encore appel&eacute; binning 2x2). Enfin la Basse d&eacute;finition consiste &agrave; rassembler les pixels du composant CCD par paquets de seize dans l'image finale (encore appel&eacute; binning 4x4). Plus la d&eacute;finition est haute, meilleure est la r&eacute;solution, mais en contre partie l'image occupe un plus grand volume en m&eacute;moire et est plus longue pour &ecirc;tre lue.</p>
  <p>Le bouton GO CCD permet de d&eacute;marrer l'acquisition de l'image. A la fin de la lecture, l'image est automatiquement affich&eacute;e dans la fen&ecirc;tre d&eacute;di&eacute;e (fond bleu-vert) de la fen&ecirc;tre principale d'Audace. Pendant la prise de vue, le libell&eacute; Acquisition du cadre suivant</p>
  <p align="center"><img src="images/interfa2/interfa2-12-fr.jpg" height="29" width="101" alt="" /></p>
  <p>est remplac&eacute; par Rin&ccedil;age CDD (en rouge) pendant la phase du nettoyage &eacute;lectronique du CCD, ensuite c'est le d&eacute;compte du temps d'exposition qui appara&icirc;t (10/10, 9/10, 8/10, 7/10, ...) comme par exemple</p>
  <p align="center"><img src="images/interfa2/interfa2-13-fr.jpg" height="27" width="96" alt="" /></p>
  <p>(5/10 signifie que le d&eacute;compte en est &agrave; 5 s sur une exposition totale de 10 s), puis c'est le libell&eacute; Lecture CCD.</p>
  <p align="center"><img src="images/interfa2/interfa2-14-fr.jpg" height="28" width="98" alt="" /></p>
  <p>qui s'inscrit pour indiquer que l'on est &agrave; la phase de lecture des pixels du capteur CCD, enfin apr&egrave;s l'affichage de l'image on retrouve le nom du panneau, soit Acquisition dans notre cas. Le fonctionnement de la cam&eacute;ra CCD est ainsi trac&eacute;, nous savons &agrave; chaque instant &agrave; quelle phase de l'acquisition nous sommes.</p>
  <p>Une remarque, pendant l'acquisition, vous pouvez avoir &agrave; l'&eacute;cran la fen&ecirc;tre suivante :</p>
  <p align="center"><img src="images/interfa2/interfa2-15-fr.jpg" height="498" width="638" alt="" /></p>
  <p>Vous remarquez que pendant l'acquisition, le bouton GO CCD a pris une forme particuli&egrave;re. Par s&eacute;curit&eacute;, il est inactif durant l'acquisition en cours afin d'&eacute;liminer tout risque d'appui involontaire sur lui-m&ecirc;me.</p>
  <p>L'image acquise peut &ecirc;tre enregistr&eacute;e sur le disque dur (dans le dossier dont le chemin a &eacute;t&eacute; pr&eacute;alablement d&eacute;fini par R&eacute;glages --> Configuration --> R&eacute;pertoires) en remplissant le champ Nom (avec toto dans le cas pr&eacute;sent), en ajoutant &eacute;ventuellement un Index (qui d&eacute;bute &agrave; 1 pour notre exemple), puis en appuyant sur le bouton Enregistrer. Le nom du fichier est automatiquement compl&eacute;t&eacute; par le suffixe fit, ou par toute autre extension que vous avez d&eacute;fini par R&eacute;glages --> Configuration --> Fichiers image. Apr&egrave;s enregistrement, l'index s'incr&eacute;mente d'une unit&eacute;.</p>
  <p>Comme vous pouvez le constater, il existe &eacute;galement un bouton Stop sur ce panneau Acquisition, il permet l'arr&ecirc;t de l'acquisition en cours. Pendant que le bouton GO CCD est inactif, le bouton Stop reste actif pour permettre l'interruption de l'acquisition en cours. Son action stoppe imm&eacute;diatement le d&eacute;compte du temps et lance la phase de lecture du CCD suivie par l'affichage &agrave; l'&eacute;cran de l'image. Cette image a donc &eacute;t&eacute; acquise avec un temps d'exposition tronqu&eacute; par rapport &agrave; la valeur initiale qui figurait dans le cadre Exposition (sec.).</p>
  <p>Attention &agrave; cette image (pose interrompue avant la fin), car le temps d'int&eacute;gration qui est contenu dans l'en-t&ecirc;te FITS est bien de 10 s, alors que la r&eacute;alit&eacute; est toute autre et inconnue.
  <p>Enfin pour terminer l'exploration de ce panneau, il ne nous reste plus qu'&agrave; commenter les 2 options &agrave; cocher : Continu. Celle qui est sous le bouton GO CCD et celle qui est sous le bouton Enregistrer.</p>
  <p>Si nous cochons uniquement l'option Continu qui est sous le bouton GO CCD, le panneau Acquisition r&eacute;alise des images en rafale, elles se succ&egrave;dent les unes derri&egrave;re les autres. Comme vous pouvez le constater, il n'est pas possible d'enregistrer ces images. Cette option a &eacute;t&eacute; sp&eacute;cialement con&ccedil;u pour faire des acquisitions avec une WebCam sans enregistrer les images, sa finalit&eacute; principale est d'effectuer des tests. Le panneau Acquisition devient donc :</p>
  <p align="center"><img src="images/interfa2/interfa2-16-fr.jpg" height="499" width="639" alt="" /></p>
  <p>Il nous reste &agrave; explorer les possibilit&eacute;s qui sont offertes si en plus l'option Continu sous le bouton Enregistrer est coch&eacute;e, voici le panneau associ&eacute; :</p>
  <p align="center"><img src="images/interfa2/interfa2-17-fr.jpg" height="499" width="639" alt="" /></p>
  <p>Vous constatez que le bouton Enregistrer s'est modifi&eacute;. Il porte d&eacute;sormais le libell&eacute; Sauvegarde automatique en gris&eacute;, il est donc impossible d'agir sur lui. Ce que nous constatons, c'est qu'au fur et &agrave; mesure des acquisitions, l'Index passe successivement de 1, &agrave; 2, &agrave; 3, etc. Il s'incr&eacute;mente image apr&egrave;s image et elles sont automatiquement enregistr&eacute;es sur le disque dur, jusqu'&agrave; ce qu'un appui sur le bouton Stop vienne arr&ecirc;ter le processus en cours.</p>

	<h3> 3. Focalisation</h3>
  <p>La focalisation consiste &agrave; r&eacute;gler la position de la cam&eacute;ra sur l'axe optique du t&eacute;lescope de fa&ccedil;on &agrave; avoir les images les plus nettes possibles. Dans le menu d&eacute;roulant Panneau, vous devez s&eacute;lectionner Focalisation ou Foc. AudeCom. La capture d'&eacute;cran ci-dessous correspond au cas Focalisation :</p>
  <p align="center"><img src="images/interfa2/interfa2-18-fr.jpg" alt="" /></p>>
  <p>Le panneau Focalisation se pr&eacute;sente ainsi :</p>
  <p align="center"><img src="images/interfa2/interfa2-19-fr.jpg" height="498" width="638" alt="" /></p>
  <p>Dans le cas du panneau Foc. AudeCom, on a l'&eacute;cran suivant :</p>
  <p align="center"><img src="images/interfa2/interfa2-20-fr.jpg" height="498" width="638" alt="" /></p>
  <p>Malgr&eacute; leurs diff&eacute;rences graphiques ces 2 panneaux assurent la m&ecirc;me fonction : Obtenir la meilleure focalisation possible. Il suffit de savoir que le panneau Focalisation peut &ecirc;tre associ&eacute; aux t&eacute;lescopes LX200 ou compatibles, et que le panneau Foc. AudeCom est lui r&eacute;serv&eacute; exclusivement au t&eacute;lescope poss&eacute;dant une motorisation par moteurs pas &agrave; pas du type AudeCom configur&eacute;e en mode natif. Le t&eacute;lescope AudeCom peut &ecirc;tre configur&eacute; en mode LX200, dans ce cas il faut utiliser le panneau Focalisation. Tout ce qui concerne <a href="interfa4.htm">le pilotage des t&eacute;lescopes</a> est d&eacute;crit plus en d&eacute;tails dans une autre page.</p>
  <p>Si vous ne poss&eacute;dez aucun de ces t&eacute;lescopes, il vous est heureusement possible d'utiliser le panneau Focalisation. La seule diff&eacute;rence que vous aurez avec les heureux possesseurs de ce type de t&eacute;lescope, c'est que les boutons + et -, ainsi que la vitesse du moteur de focalisation ne seront pas actifs :
  <p align="center"><img src="images/interfa2/interfa2-21-fr.jpg" height="63" width="100" alt="" /></p>
  <p>Pour commencer cette phase de recherche de la meilleure focalisation, il faut d&eacute;buter par une acquisition en mode Centrage. Un appui sur le bouton GO CCD permet de faire une premi&egrave;re image avec le mode Centrage. Elle se fait automatiquement en binning 2x2 (donc en d&eacute;finition moyenne). Elle permet de choisir une &eacute;toile dans le champ pour r&eacute;gler la focalisation. Cette s&eacute;lection s'effectue avec la souris en encadrant l'&eacute;toile choisie d'un rectangle (rectangle bleu sur l'&eacute;toile la plus &agrave; droite, il s'agit de Hip 64429 qui a une magnitude 8,3) avec le bouton gauche appuy&eacute;. On obtient par exemple l'&eacute;cran qui suit :</p>
  <p align="center"><img src="images/interfa2/interfa2-22-fr.jpg" height="499" width="639" alt="" />
  <p>Pendant l'acquisition de cette image, vous constatez que le bouton R.A.Z. (remise &agrave; z&eacute;ro) s'est transform&eacute; en Stop, il est donc possible d'arr&ecirc;ter cette acquisition en cours si un probl&egrave;me est d&eacute;tect&eacute; (mauvais temps de pose par exemple). Ensuite, apr&egrave;s l'affichage de l'image nouvellement acquise ce bouton r&eacute;cup&egrave;re la fonction R.A.Z..</p>
  <p>Il faut choisir une &eacute;toile suffisamment brillante mais qui ne sature pas le capteur CCD. Ensuite vous devez passer en mode Fen&ecirc;tre en appuyant avec le bouton gauche de la souris sur le bouton d&eacute;di&eacute; (voir ci-dessous).</p>
  <p align="center"><img src="images/interfa2/interfa2-24-fr.jpg" height="56" width="249" alt="" />
  <p>Puis vous lancez l'acquisition par un appui sur le bouton GO CCD en ne posant pas plus de 3 &agrave; 4 secondes. Elle se fait automatiquement en mode rafale d'images et en binning 1x1 (c'est &agrave; dire en haute d&eacute;finition) pour la fen&ecirc;tre s&eacute;lectionn&eacute;e pr&eacute;c&eacute;demment autour de l'&eacute;toile.</p>
  <p>Apr&egrave;s chaque image, une liste de param&egrave;tres concernant l'&eacute;toile s&eacute;lectionn&eacute;e est affich&eacute;e dans la partie inf&eacute;rieure du panneau : Le num&eacute;ro d'ordre de l'image dans la rafale, l'intensit&eacute;, les fwhm en
  x et en y (c'est &agrave; dire les largeurs &agrave; mi-hauteur des &eacute;toiles selon 2 axes perpendiculaires) et le contraste. On obtient un &eacute;cran similaire &agrave; ce qui suit en utilisant un LX200 de 8" (203 mm d'ouverture) ouvert &agrave; F/D=6 environ, &eacute;quip&eacute; d'une Audine avec un Kaf-0401E, sur l'&eacute;toile Hip 64429 de magnitude 8,3 :</p>
  <p align="center"><img src="images/interfa2/interfa2-23-fr.jpg" height="499" width="639" alt="" />
  <p>Dans le cas de notre exemple, nous en sommes &agrave; la 123i&egrave;me image de la rafale. Vous constatez &agrave; nouveau que le bouton R.A.Z. s'est transform&eacute; en Stop ce qui permet d'arr&ecirc;ter &agrave; tout moment l'acquisition en mode rafale. Une fois le mode rafale arr&ecirc;t&eacute;, le bouton Stop se transforme &agrave; nouveau en R.A.Z., ici nous avons 2 options possibles :</p>
  <ul>
    <li> Soit vous choisissez de red&eacute;marrer l'acquisition en mode rafale par un simple appui sur le bouton GO CCD, dans ce cas vous constatez que le num&eacute;ro de l'image dans la rafale continue &agrave; s'incr&eacute;menter.</li>
    <li> Soit vous choisissez d'appuyer sur le bouton R.A.Z., dans ce cas vous remarquez que la zone r&eacute;serv&eacute;e &agrave; l'affichage du num&eacute;ro de l'image dans la rafale, de l'intensit&eacute;, des fwhm et du contraste s'efface. Elle est pr&ecirc;te pour une nouvelle s&eacute;rie d'acquisition.</li>
  </ul>
  <p>Il faut affiner la mise au point de fa&ccedil;on &agrave; minimiser les valeurs des fwhm (en x et en y) et &agrave; maximiser celles de l'intensit&eacute; et du contraste. Pour vous aider, il est utile de s&eacute;lectionner la fonctionnalit&eacute; Graphe pour suivre l'&eacute;volution de l'ensemble de ces param&egrave;tres (pour cela appuyer sur le bouton Graphe), vous obtenez :</p>
  <p align="center"><img src="images/interfa2/interfa2-25-fr.jpg" height="497" width="448" alt="" />
  <p>Si vous poss&eacute;dez un t&eacute;lescope muni d'une mise au point motoris&eacute;e et pilot&eacute;e par Aud'Ace, l'appui sur les touches + et - de Moteur de foc. permet la commande &agrave; distance du moteur de focalisation. Le point d'interrogation (?) qui se situe (parfois) entre les boutons + et - permet de r&eacute;gler la vitesse de rotation du moteur. Il suffit d'appuyer dessus pour changer la vitesse. Par exemple, un premier appui passe le moteur de focalisation en premi&egrave;re vitesse (chiffre 1) :</p>
  <p align="center"><img src="images/interfa2/interfa2-26-fr.jpg" height="59" width="97" alt="" />
  <p>Un second appui, sur le chiffre 1 cette fois, passe le moteur en deuxi&egrave;me vitesse (chiffre 2), seulement 2 vitesses sont disponibles pour la focalisation. Lorsque la vitesse maximale est atteinte, l'appui suivant repasse en premi&egrave;re vitesse et ainsi de suite. Pour le panneau Foc. AudeCom, le chiffre 1 est remplac&eacute; par x1 et le chiffre 2 par x5, ce qui signifie que la deuxi&egrave;me vitesse est 5 fois plus &eacute;lev&eacute;e que la premi&egrave;re.</p>
  <p>Il y a tout de m&ecirc;me une autre diff&eacute;rence entre les panneaux Focalisation et Foc. AudeCom. Elle se situe au niveau de l'affichage des informations concernant la qualit&eacute; de l'acquisition en mode rafale (le num&eacute;ro de l'image dans la rafale, l'intensit&eacute;, les fwhm en x et en y et le contraste) car la place n&eacute;cessaire est utilis&eacute;e par les boutons de commande du moteur de focalisation d'AudeCom en mode natif.</p>
  <p align="center"><img src="images/interfa2/interfa2-27-fr.jpg" height="213" width="266" alt="" /></p>
  <p>L'affichage de ces informations se fait tout simplement dans une fen&ecirc;tre ind&eacute;pendante. Voici la capture d'&eacute;cran correspondante, toujours pour la 123i&egrave;me image de la rafale :</p>
  <p align="center"><img src="images/interfa2/interfa2-28-fr.jpg" height="496" width="638" alt="" /></p>
  <p>L'utilisation des boutons Se trouve &agrave;, Aller &agrave; et Initialisation est d&eacute;crite dans la page consacr&eacute;e <a href="interfa4.htm">au pilotage des t&eacute;lescopes</a>.</p>

	<h3> 4. Acquisition de s&eacute;ries d'images</h3>
  <p>Certaines images doivent &ecirc;tre enregistr&eacute;es plusieurs fois de suite en vue d'am&eacute;liorer la qualit&eacute; lors des traitements appropri&eacute;s. Il est donc utile d'encha&icirc;ner plusieurs poses automatiquement. Dans le menu d&eacute;roulant Panneau, il suffit de s&eacute;lectionner Acq. imagerie :</p>
  <p align="center"><img src="images/interfa2/interfa2-29-fr.jpg" height="343" width="638" alt="" /></p>
  <p>Le panneau Acq. imagerie se pr&eacute;sente ainsi :</p>
  <p align="center"><img src="images/interfa2/interfa2-30-fr.jpg" height="496" width="638" alt="" /></p>
  <p>Il suffit d'indiquer le Nombre de poses (5 dans notre exemple), la dur&eacute;e de l'Exposition de chaque pose individuelle en secondes (10), la D&eacute;finition choisie (Moyenne ici) ainsi que le nom g&eacute;n&eacute;rique dans le champ S&eacute;lection du nom &agrave; partir duquel sont construits les noms des images (noir dans notre cas). Pour l'exemple ci-dessus, les 5 images avec le nom g&eacute;n&eacute;rique noir auront pour noms de fichier : noir1.fit, noir2.fit, noir3.fit, noir4.fit et noir5.fit (fit est l'extension par d&eacute;faut). De plus une image suppl&eacute;mentaire appel&eacute;e noir.fit est &eacute;galement enregistr&eacute;e sur votre disque dur, elle correspond &agrave; la m&eacute;diane des 5 images noir1.fit &agrave; noir5.fit. Nous vous rappelons que le choix de l'extension des fichiers images est choisi par R&eacute;glages --> Configuration --> Fichier images.</p>
  <p>Vous pouvez suivre le d&eacute;roulement de la s&eacute;rie par l'affichage suivant</p>
  <p align="center"><img src="images/interfa2/interfa2-31-fr.jpg" height="27" width="97" alt="" /></p>
  <p>&agrave; la place du nom du panneau Acq. imagerie. La signification de la suite de chiffres est la suivante :</p>
  <ul>
    <li> 6/10 : Il reste 6 secondes avant la fin de cette pose qui a une dur&eacute;e totale de 10 s.</li>
    <li> (3:5) : On est en train d'acqu&eacute;rir la 3i&egrave;me image d'une s&eacute;rie de 5.</li>
  </ul>
  <p>Pour lancer une s&eacute;rie de poses, il suffit d'appuyer sur le bouton GO CCD. Le bouton Stop arr&ecirc;te l'image en cours et la s&eacute;rie. Attention &agrave; cette image qui malgr&eacute; l'information pr&eacute;sente dans l'en-t&ecirc;te FITS a &eacute;t&eacute; acquise avec un temps d'exposition tronqu&eacute;.</p>
  <p>Enfin il faut savoir que si vous cochez la case situ&eacute;e apr&egrave;s ou nom du fichier automatique, le nom g&eacute;n&eacute;rique des images est g&eacute;n&eacute;r&eacute; automatiquement et est ind&eacute;pendant du libell&eacute; pr&eacute;sent dans le champ S&eacute;lection du nom. A vous de choisir entre le contr&ocirc;le ou non du nom des images acquises.</p>
  <p>Dans tous les cas, les images sont enregistr&eacute;es automatiquement sur votre disque dur.</p>

	<h3> 5. Acquisition en mode drift scan</h3>
  <p>Le drift scan permet l'acquisition d'images avec un instrument non motoris&eacute;, c'est le ciel qui d&eacute;file devant le capteur CCD. Ce mode de fonctionnement particulier consiste &agrave; lire l'image qui sort du CCD en continu. Pour plus de d&eacute;tails <a href="script3c.htm">la technique du scan est d&eacute;crite</a> dans le chapitre concernant les scripts. Audace permet de param&eacute;trer facilement l'acquisition en mode drift scan gr&acirc;ce &agrave; un panneau sp&eacute;cifique. Le panneau Drift scan est accessible &agrave; partir du menu d&eacute;roulant Panneau de l'interface Audace :
  </p>
  <p align="center"><img src="images/interfa2/interfa2-32-fr.jpg" height="370" width="638" alt="" />
  <p>Le panneau Drift scan se pr&eacute;sente ainsi :</p>
  <p align="center"><img src="images/interfa2/interfa2-33-fr.jpg" height="498" width="638" alt="" />
  <p>Ce panneau permet avant tout de dimensionner l'image &agrave; acqu&eacute;rir. L'intitul&eacute; Colonnes permet de d&eacute;finir les deux colonnes entre lesquelles va &ecirc;tre r&eacute;alis&eacute;e l'image. Dans le cas de notre exemple, l'image sera acquise entre les colonnes 1 et 768. Comme il s'agit d'une cam&eacute;ra CCD Audine &eacute;quip&eacute;e d'un Kaf-0400, l'image concerne la totalit&eacute; de la largeur du capteur. Ces valeurs sont ind&eacute;pendantes du binning (c'est &agrave; dire de la d&eacute;finition : haute, moyenne ou basse) et sont &eacute;quivalentes aux indices des colonnes des photosites sur la matrice CCD. L'orientation de la matrice, &agrave; l'&eacute;cran, a &eacute;t&eacute; choisi pour avoir le registre de lecture du CCD en bas. Sur le t&eacute;lescope, il y a de fortes chances pour qu'il en soit autrement. L'intitul&eacute; Lignes permet de choisir le nombre de lignes qui vont &ecirc;tre acquises (1500 ici), c'est la longueur de l'image.</p>
  <p>L'intitul&eacute; Interligne permet de choisir la d&eacute;finition (c'est &agrave; dire le binning) entre Basse d&eacute;f., Moy. d&eacute;f. et Haute d&eacute;f., de d&eacute;finir la longueur Focale (en m) de l'instrumentation utilis&eacute;e ainsi que la d&eacute;clinaison point&eacute;e par le t&eacute;lescope (D&eacute;c. en &deg;) et de param&eacute;trer le d&eacute;lais d'attente (en millisecondes) entre chaque d&eacute;calage de ligne (c'est la synchronisation). L'appui sur le bouton Calcul permet de d&eacute;terminer la valeur optimale du d&eacute;lai d'interligne (en millisecondes) pour la configuration d&eacute;finie. Il est toutefois possible d'entrer une valeur du d&eacute;lai d'interligne manuellement. Si un t&eacute;lescope est connect&eacute;, le champ situ&eacute; apr&egrave;s le bouton D&eacute;c. (d&eacute;clinaison) est renseign&eacute; automatiquement par la lecture des codeurs (LX200 et Ouranos) ou du microcontr&ocirc;leur (AudeCom) &agrave; l'ouverture du panneau Drift scan. Le bouton D&eacute;c. permet de rafra&icirc;chir l'affichage de la d&eacute;clinaison courante du telescope connect&eacute;, lorsque ce dernier est arriv&eacute; &agrave; destination du champ &agrave; acqu&eacute;rir.</p>
  <p>L'intitul&eacute; Acquisition permet de lancer l'acquisition du scan. Si on appuie sur le bouton GO CCD on/off avec le bouton gauche de la souris, le moteur du t&eacute;lescope s'arr&ecirc;te automatiquement avant la pose (un d&eacute;lai d'attente entre l'arr&ecirc;t du moteur et le d&eacute;but de la pose peut &ecirc;tre d&eacute;fini par R&eacute;glages --> Configuration --> Drift scan et scan rapide) et red&eacute;marre juste apr&egrave;s la fin (dans la mesure o&ugrave; il y a un t&eacute;lescope connect&eacute; et &eacute;quip&eacute; d'un syst&egrave;me marche/arr&ecirc;t du moteur de suivi en ascension droite). Il est &eacute;galement possible d'effectuer un scan sans arr&ecirc;ter le moteur, pour cela il suffit d'appuyer sur le bouton GO CCD on/off avec le bouton droit de la souris. La pr&eacute;sence d'un bouton Stop signifie que l'on peut &agrave; tout moment arr&ecirc;ter un scan en cours d'acquisition.</p>
  <p>Comme nous l'avons d&eacute;ja vu pour les autres panneaux d&eacute;di&eacute;s &agrave; l'acquisition, le libell&eacute; du bouton GO CCD on/off est gris&eacute; pendant l'acquisition du scan et par s&eacute;curit&eacute;, il est inactif durant l'acquisition en cours afin d'&eacute;liminer tout risque d'appui involontaire sur lui-m&ecirc;me. La seule possibilit&eacute; reste donc l'appui sur le bouton Stop pour arr&ecirc;ter le scan en cours d'acquisition.</p>

	<h3> 6. Acquisition en mode scan rapide</h3>
  <p>Pourquoi utiliser un mode Scan rapide : Ce mode de fonctionnement est tr&egrave;s utile pour la prise d'images CCD d'un ph&eacute;nom&egrave;ne rapide tel qu'une occulation d'&eacute;toile par un ast&eacute;ro&iuml;de, par exemple. Les occultations standards durent entre 1 et 30 secondes. L'incertitude sur l'instant d'occultation est tel qu'il est souvent n&eacute;cessaire de commencer &agrave; surveiller l'&eacute;toile pendant plusieurs minutes centr&eacute;es sur la pr&eacute;diction. Dans ces conditions, il est n&eacute;cessaire d'effectuer des mesures rapides, avec une r&eacute;solution temporelle inf&eacute;rieure &agrave; 0.2 seconde, si l'on veut &ecirc;tre plus performant que l'oeil, et pendant une dur&eacute;e d'environ 5 minutes. De plus, une grande dur&eacute;e d'enregistrement permet de d&eacute;tecter la pr&eacute;sence &eacute;ventuelle d'un satellite autour de l'ast&eacute;ro&iuml;de.</p>
  <p>Pour faire une acquisition en mode Scan rapide, il faut s&eacute;lectionner le panneau Scan rapide. Pour cela, vous devez ouvrir le menu d&eacute;roulant Panneau, puis cliquer sur Scan rapide, voici ce que vous obtenez &agrave; l'&eacute;cran :</p>
  <p align="center"><img src="images/interfa2/interfa2-34-fr.jpg" height="344" width="638" alt="" />
  <p>Le panneau Scan rapide se pr&eacute;sente ainsi :</p>
  <p align="center"><img src="images/interfa2/interfa2-35-fr.jpg" height="498" width="638"  alt="" />
  <p>A compl&eacute;ter</p>

	<h3> 7. Acquisition d'une image par une Audine avec un CCD couleur</h3>
  <p>A compl&eacute;ter </p>

	<h3> 8. Param&eacute;trage et acquisition d'une image avec une WebCam</h3>
  <p>Attention Audace ne supporte que des WebCams connect&eacute;es &agrave; votre micro-ordinateur par un port USB.</p>
  <p>A compl&eacute;ter</p>

	<h3> 9. Probl&egrave;mes fr&eacute;quemment rencontr&eacute;s</h3>
  <p>Image uniform&eacute;ment noire : V&eacute;rifier le branchement de la cam&eacute;ra CCD. M&ecirc;me en l'absence de lumi&egrave;re, le signal d&eacute;livr&eacute; par la cam&eacute;ra n'est jamais nul (signal de bias au minimum).</p>
  <p>Image uniform&eacute;ment blanche : Trop de lumi&egrave;re arrive sur le CCD. Baffler le t&eacute;lescope et poser moins longtemps.</p>
  <p>Parasites : V&eacute;rifier que le c&acirc;ble reliant l'ordinateur &agrave; la cam&eacute;ra CCD ne passe pas &agrave; c&ocirc;t&eacute; d'une source &agrave; haute fr&eacute;quence (tube n&eacute;on par exemple).</p>
</body>
</html>
