<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">

<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
<title>Installer le protocole TCP/IP sous Windows 95/98</title>
</head>

<body>
<p>Nous d&eacute;crivons, ici, la m&eacute;thode pour installer un r&eacute;seau informatique &agrave; domicile sous le syst&egrave;me d'exploitation Windows 95. La m&eacute;thode est identique avec Windows 98.</p>
<h3> 1. G&eacute;n&eacute;ralit&eacute;s sur les r&eacute;seaux</h3>
<p>Un r&eacute;seau est un ensemble d'ordinateurs li&eacute;s (par un c&acirc;ble ou par tout autre moyen de communication). On peut ainsi disposer des donn&eacute;es ou des logiciels pr&eacute;sents sur le disque dur d'un ordinateur distant ou bien lui envoyer des ordres de travail. Une application, pour l'astronomie amateur, est de pouvoir piloter son mat&eacute;riel d'observation par un ordinateur install&eacute; au chaud, &agrave; la maison, en transmettant des directives d'ex&eacute;cution &agrave; l'ordinateur plac&eacute; dehors auquel sont reli&eacute;s les instruments d'observation (t&eacute;lescope, cam&eacute;ra CCD, etc.). </p>
<p>Il existe diff&eacute;rents types de r&eacute;seaux mais nous n'&eacute;tudierons ici que le cas d'un r&eacute;seau local qu'un particulier veut installer chez lui afin de faire fonctionner le logiciel Audela. Ce r&eacute;seau &eacute;tant local, on consid&eacute;rera qu'il n'a aucune liaison ext&eacute;rieure. En g&eacute;n&eacute;ral, un tel r&eacute;seau relie quelques machines seulement.</p>
<p>La premi&egrave;re &eacute;tape d'une mise en r&eacute;seau consiste &agrave; acheter autant de cartes r&eacute;seau que l'on veut relier d'ordinateurs entre eux (compter 25 Euros par carte). Il faut aussi acheter des c&acirc;bles coaxiaux &agrave; prises BNC (n-1 c&acirc;bles pour n ordinateurs en comptant 1 Euro par m&egrave;tre). </p>
<p>Il est possible d'utiliser des c&acirc;bles &eacute;quip&eacute;s de prises RJ45 au lieu des c&acirc;bles coaxiaux. Les prises RJ45 se connectent alors &agrave; un bo&icirc;tier central de distribution, appel&eacute; HUB. En g&eacute;n&eacute;ral, on peut connecter huit RJ45 sur les HUB &agrave; prix &eacute;conomiques. On trouve aussi des kits complets (2 c&acirc;bles + HUB + 2 cartes r&eacute;seau pour environ 100 Euros).</p>
<p>Dans le cas o&ugrave; l'on souhaite utiliser Audela en r&eacute;seau sur un seul ordinateur (c'est &agrave; dire que plusieurs Audela tournent ensemble sur le m&ecirc;me ordinateur et on souhaite les faire communiquer entre eux), il n'est pas n&eacute;cessaire d'acheter de carte et de c&acirc;ble r&eacute;seau. Il faudra tout de m&ecirc;me <a href="#21">installer le pilote de la carte d'acc&egrave;s distant de Microsoft </a>et<a href="#3"> le protocole TCP/IP</a>.</p>
<p>Dans le cas de connexions par c&acirc;ble coaxile et prise BNC, le sch&eacute;ma des branchements &agrave; effectuer pour relier trois ordinateurs est le suivant :</p>
<p align="center"><img src="images/audela_reseau/reseau3.jpg" height="143" width="514" /> </p>
<p>Chaque carte r&eacute;seau est munie d'un T &agrave; prises BNC (g&eacute;n&eacute;ralement fourni avec la carte). Les c&acirc;bles BNC se relient entre les T, jamais directement sur la sortie de la carte (sinon le r&eacute;seau ne fonctionne pas). Enfin, il est indispensable de mettre deux bouchons BNC (r&eacute;sistances de 50 Ohms) &agrave; chaque bout du r&eacute;seau. En g&eacute;n&eacute;ral, la longueur totale du r&eacute;seau ne devra pas exc&eacute;der 150 m&egrave;tres.</p>
<h3> 2. Installation du pilote de la carte r&eacute;seau</h3>
<p>L'installation du pilote de la carte r&eacute;seau est obligatoire, m&ecirc;me si l'on souhaite utiliser Audela avec un seul ordinateur que l'on n'a pas &eacute;quip&eacute; de carte r&eacute;seau. Dans ce cas on suivra la proc&eacute;dure d'<a href="#21">installation sans carte r&eacute;seau</a>. Dans le cas o&ugrave; l'on a install&eacute; une carte r&eacute;seau dans les ordinateurs &agrave; relier, aller directement au paragraphe concernant l'<a href="#22">installation avec carte r&eacute;seau</a>.</p>
<h3> <a name="21">2.1. Installation sans carte r&eacute;seau</a></h3>
<p> Dans le cas o&ugrave; l'on ne poss&egrave;de qu'un seul ordinateur et que l'on n'y installe pas de carte r&eacute;seau, il est n&eacute;cessaire d'installer le pilote de "Carte d'acc&egrave;s distant" fourni par Microsoft. Pour cela, ouvrir la fen&ecirc;tre du panneau de configuration (bouton D&eacute;marrer puis Param&egrave;tres et cliquer sur Panneau de configuration) puis ouvrir la fen&ecirc;tre de configuration du r&eacute;seau en cliquant sur l'ic&ocirc;ne<img src="images/audela_reseau/reseau1.jpg" height="59" width="56" />. Si vous voyez<img src="images/audela_reseau/res5.jpg" height="16" width="122" /> dans la liste des "composants r&eacute;seau install&eacute;s" alors passer directement &agrave; l'<a href="#3">installation du protocole TCP/IP</a>. Sinon, appuyer sur le bouton Ajouter pour obtenir la fen&ecirc;tre suivante (s&eacute;lection du type de composant r&eacute;seau) :</p>
<p align="center"><img src="images/audela_reseau/res4.jpg" height="225" width="395" /> </p>
<p>S&eacute;lectionner "Carte" et appuyer sur le bouton Ajouter pour faire appara&icirc;tre la fen&ecirc;tre de s&eacute;lection des cartes r&eacute;seau :
<p align="center"><img src="images/audela_reseau/res1.jpg" height="322" width="441" /> </p>
<p>Dans la rubrique Constructeurs, s&eacute;lectionner Microsoft et dans la rubrique Cartes r&eacute;seau, s&eacute;lectionner Carte d'acc&egrave;s distant puis appuyer sur le bouton OK. Le pilote de la carte d'acc&egrave;s distant s'installe (l'installation demande g&eacute;n&eacute;ralement &agrave; lire des informations sur le disque d'installation de Windows). Il faut red&eacute;marrer l'ordinateur pour que l'installation soit prise en compte.</p>
<p>On peut maintenant passer &agrave; l'<a href="#3">installation du protocole TCP/IP</a> mais il est conseill&eacute; de <a href="#23">v&eacute;rifier pr&eacute;alablement que l'installation du pilote est r&eacute;ussie</a>.</p>
<h3> <a name="22"></a>2.2. Installation avec carte r&eacute;seau</h3>
<p> Au d&eacute;marrage de l'ordinateur, Windows d&eacute;tecte automatiquement la pr&eacute;sence de la carte r&eacute;seau qui vient d'&ecirc;tre install&eacute;e et propose une fen&ecirc;tre d'installation intitul&eacute;e "nouveau p&eacute;riph&eacute;rique d&eacute;tect&eacute;". Il suffit de suivre les indications pour poursuivre l'installation. A la fin de l'installation, il faut red&eacute;marrer l'ordinateur pour qu'elle soit prise en compte.</p>
<p>Dans le cas o&ugrave; Windows n'a pas d&eacute;tect&eacute; la carte r&eacute;seau au d&eacute;marrage, il suffit de suivre la proc&eacute;dure d&eacute;crite dans le paragraphe concernant l'<a href="#21">installation sans carte r&eacute;seau</a> aux d&eacute;tails suivants pr&ecirc;ts. Si l'on n'a pas la disquette d'installation de la carte r&eacute;seau, dans la fen&ecirc;tre de s&eacute;lection des cartes r&eacute;seau &agrave; la rubrique Constructeurs, s&eacute;lectionner celui de votre carte et dans la rubrique Cartes r&eacute;seau, s&eacute;lectionner le mod&egrave;le puis appuyer sur le bouton OK. Si l'on poss&egrave;de une disquette d'installation du pilote de la carte r&eacute;seau, l'ins&eacute;rer dans le lecteur de disquette puis appuyer sur le bouton "Disquette fournie". Le pilote de la carte r&eacute;seau s'installe (l'installation demande g&eacute;n&eacute;ralement &agrave; lire des informations sur le disque d'installation de Windows). Il faut red&eacute;marrer l'ordinateur pour que l'installation soit prise en compte.</p>
<p>On peut maintenant passer &agrave; l'<a href="#3">installation du protocole TCP/IP</a> mais il est conseill&eacute; de <a href="#23">v&eacute;rifier pr&eacute;alablement que l'installation du pilote est r&eacute;ussie</a>.</p>
<h3> 2.3. V&eacute;rification de l'installation du pilote de carte r&eacute;seau</h3>
<p><a name="23"></a>On v&eacute;rifiera que le pilote de la carte r&eacute;seau fonctionne correctement. Pour cela, ouvrir la fen&ecirc;tre du panneau de configuration (bouton D&eacute;marrer puis Param&egrave;tres et cliquer sur Panneau de configuration). Ouvrir la fen&ecirc;tre de configuration du syst&egrave;me en cliquant sur l'ic&ocirc;ne<img src="images/audela_reseau/systeme0.jpg" height="60" width="51" /> qui permet d'ouvrir la fen&ecirc;tre <i>Propri&eacute;t&eacute;s Syst&egrave;me</i> que l'on positionnera sur la page correspondant &agrave; l'onglet "Gestionnaire de p&eacute;riph&eacute;riques" :</p>
<p align="center"><img src="images/audela_reseau/systeme1.jpg" height="448" width="446" /> </p>
<p>On v&eacute;rifiera que la carte r&eacute;seau fonctionne bien en s&eacute;lectionnant son nom et en cliquant sur le bouton Propri&eacute;t&eacute;s. Dans la nouvelle fen&ecirc;tre qui s'ouvre et dans la page de l'onglet "g&eacute;n&eacute;ral" on lira que tout fonctionne correctement dans la rubrique concernant l'&eacute;tat du p&eacute;riph&eacute;rique. S'il y a un probl&egrave;me, c'est probablement d&ucirc; &agrave; une mauvaise valeur prise par la requ&ecirc;te d'interruption. Dans ce cas, ouvrir la page de l'onglet "Ressources" puis changer la valeur du param&egrave;tre de la requ&ecirc;te d'interruption (IRQ) en d&eacute;cochant "Utiliser les param&egrave;tres automatiques". En g&eacute;n&eacute;ral les IRQ 5, 10 et 15 sont disponibles et peuvent &ecirc;tre utilis&eacute;s sans conflit par la carte r&eacute;seau.</p>
<h3> <a name="identif"></a>2.4. Identification de l'ordinateur sur le r&eacute;seau</h3>
<p> Ouvrir la fen&ecirc;tre du panneau de configuration (bouton D&eacute;marrer puis Param&egrave;tres et cliquer sur Panneau de configuration) puis ouvrir la fen&ecirc;tre de configuration du r&eacute;seau en cliquant sur l'ic&ocirc;ne<img src="images/audela_reseau/reseau1.jpg" height="59" width="56" />. Appuyer sur l'onglet Identification pour obtenir la fen&ecirc;tre suivante :</p>
<p align="center"><img src="images/audela_reseau/reseau10.jpg" height="460" width="367" /> </p>
<p>Donner un Nom &agrave; l'ordinateur. Ne pas mettre d'espace. Donner un nom au Groupe de travail qui doit &ecirc;tre exactement le m&ecirc;me pour chaque ordinateur qui va utiliser le r&eacute;seau. Enfin, il est utile de mettre une description de l'ordinateur sur la derni&egrave;re ligne de l'identification.</p>
<h3> <a name="3"></a>3. Installation du protocole TCP/IP</h3>
<p> Si votre ordinateur sert &agrave; vous connecter sur Internet via un fournisseur d'acc&egrave;s, le protocole TCP/IP doit normalement &ecirc;tre d&eacute;j&agrave; install&eacute;. Dans les autres cas, v&eacute;rifier pr&eacute;alablement que <a href="#23">le pilote de la carte r&eacute;seau fonctionne correctement</a>. Cela fait, ouvrir la fen&ecirc;tre du panneau de configuration (bouton D&eacute;marrer puis Param&egrave;tres et cliquer sur Panneau de configuration) puis ouvrir la fen&ecirc;tre de configuration du r&eacute;seau en cliquant sur l'ic&ocirc;ne <img src="images/audela_reseau/reseau1.jpg" height="59" width="56" />. Dans la page associ&eacute;e &agrave; l'onglet Configuration, appuyer sur le bouton Ajouter pour obtenir la fen&ecirc;tre suivante : </p>
<p align="center"><img src="images/audela_reseau/reseau2.jpg" height="225" width="395" /> </p>
<p>S&eacute;lectionner "Protocole" et appuyer sur le bouton Ajouter pour faire appara&icirc;tre la fen&ecirc;tre de s&eacute;lection du protocole r&eacute;seau :</p>
<p align="center"><img src="images/audela_reseau/reseau4.jpg" height="322" width="441" /> </p>
<p>Dans la rubrique Constructeurs, s&eacute;lectionner Microsoft et dans la rubrique Protocoles r&eacute;seau, s&eacute;lectionner TCP/IP puis appuyer sur le bouton OK. Le protocole TCP/IP s'installe. Il faut g&eacute;n&eacute;ralement red&eacute;marrer l'ordinateur pour qu'il soit pris en compte.</p>
<p>Il faut noter qu'il est autoris&eacute; d'installer plusieurs protocoles de communication &agrave; la fois. Souvent, le protocole NetBEUI s'installe automatiquement avec le pilote de la carte. Ceci n'est pas g&ecirc;nant mais on prendra garde &agrave; ce que le protocole par d&eacute;faut ne soit pas NetBEUI. Pour cela, aller dans la fen&ecirc;tre des propri&eacute;t&eacute;s de NetBEUI et dans la page associ&eacute;e &agrave; l'onglet "Avanc&eacute;es", d&eacute;sactiver la case intitul&eacute;e "D&eacute;finir ce protocole en tant que protocole par d&eacute;faut".</p>
<h3> 4. Configuration du protocole TCP/IP</h3>
<p> L'installation du protocole TCP/IP ne suffit pas. Il faut aussi indiquer les param&egrave;tres, sp&eacute;cifiques &agrave; chaque ordinateur, associ&eacute;s &agrave; ce protocole (le num&eacute;ro IP et &eacute;ventuellement les num&eacute;ros IP d'un ordinateur serveur comme nous allons le voir par la suite). Il faut ouvrir la fen&ecirc;tre du panneau de configuration (bouton D&eacute;marrer puis Param&egrave;tres et cliquer sur Panneau de configuration) puis ouvrir la fen&ecirc;tre de configuration du r&eacute;seau en cliquant sur l'ic&ocirc;ne <img src="images/audela_reseau/reseau1.jpg" height="59" width="56" />. La fen&ecirc;tre du r&eacute;seau pourrait ressembler &agrave; cela (noter que dans cet exemple, plusieurs protocoles ont &eacute;t&eacute; install&eacute;s) :</p>
<p align="center"><img src="images/audela_reseau/reseau5.jpg" height="460" width="367" /> </p>
<p>S&eacute;lectionner le composant TCP/IP et appuyer sur le bouton Propri&eacute;t&eacute;s. La fen&ecirc;tre des propri&eacute;t&eacute;s TCP/IP compte six onglets :</p>
<ul>
  <li> Liens</li>
  <li> Avanc&eacute;es</li>
  <li> Configuration DNS</li>
  <li> Passerelle</li>
  <li> Configuration WINS</li>
  <li> Adresse IP</li>
</ul>
<p>La page la plus importante est celle de l'adresse IP :</p>
<p align="center"><img src="images/audela_reseau/reseau6.jpg" height="439" width="401" /> </p>
<p><a name="numeroip"></a>Si votre ordinateur sert &agrave; vous connecter sur Internet, via un fournisseur d'acc&egrave;s, un num&eacute;ro IP est fourni &agrave; chaque connexion au fournisseur d'acc&egrave;s. N&eacute;anmoins, l'adresse IP sp&eacute;cifi&eacute;e dans la fen&ecirc;tre des propri&eacute;t&eacute;s TCP/IP n'int&eacute;ragit pas avec celle fournie par votre fournisseur d'acc&egrave;s qui utilise le protocole PPP si elle commence par 192.168 (cette &eacute;serie d'adresses IP est sp&eacute;cialement d&eacute;di&eacute;e aux r&eacute;seaux locaux et dite non "routable"). Ainsi, vous pouvez utiliser votre r&eacute;seau local tout en &eacute;tant en ligne sur Internet (&agrave; ce moment l&agrave;, votre ordinateur a deux adresses IP).</p>
<p>Pour utiliser Audela en r&eacute;seau local, choisir l'option Sp&eacute;cifier une adresse IP. Il convient d'apposer une suite de 4 nombres compris entre 0 et 255 dans l'adresse IP. Le masque de sous r&eacute;seau sera toujours &eacute;gal &agrave; 255.255.255.0. Si l'on compte utiliser l'ensemble des applications sur un m&ecirc;me ordinateur, il n'est pas n&eacute;cessaire de d&eacute;clarer un num&eacute;ro IP, la machine locale ayant toujours par d&eacute;faut le num&eacute;ro IP 127.0.0.1. Dans le cas d'un r&eacute;seau local, il existe un domaine r&eacute;serv&eacute; dont les deux premiers nombres sont 192.168. Reste donc 65536 possibilit&eacute;s pour choisir les deux derniers nombres. Il faut cependant noter le num&eacute;ro IP attribu&eacute; &agrave; chaque ordinateur car il sera demand&eacute; par l'application de configuration du logiciel Audela pour pouvoir &eacute;tablir les connexions entre les applications (qui peuvent ainsi se situer sur diff&eacute;rents ordinateurs rep&eacute;r&eacute;s par leur num&eacute;ro IP). Le num&eacute;ro IP est donc le num&eacute;ro d'identification de la machine sur le r&eacute;seau. Il faut donc mettre un num&eacute;ro IP diff&eacute;rent sur chaque machine.</p>
<p>En g&eacute;n&eacute;ral, vous devez r&eacute;amorcer l'ordinateur &agrave; chaque fois que vous changez un param&egrave;tre dans la fen&ecirc;tre R&eacute;seau.</p>
<h3> 5. V&eacute;rification de la configuration TCP/IP</h3>
<p>Microsoft Windows met &agrave; disposition Winipcfg, un logiciel de v&eacute;rification des param&eacute;trages TCP/IP. Pour l'ex&eacute;cuter, taper winipcfg &agrave; l'invite de commande MS-DOS (Menu D&eacute;marrer, Programmes, Commandes MS-DOS):</p>
<p align="center"><img src="images/audela_reseau/winip1.jpg" height="359" width="652" /> </p>
<p>Une fen&ecirc;tre s'ouvre. Si votre ordinateur est configur&eacute; pour vous connecter &agrave; un fournisseur d'acc&egrave;s, les informations de la carte ethernet vous permettent de voir les param&egrave;tres associ&eacute;s &agrave; l'adaptateur PPP: </p>
<p align="center"><img src="images/audela_reseau/winip2.jpg" height="240" width="363" /></p>
<p>Si vous n'&ecirc;tes pas connect&eacute; &agrave; votre fournisseur d'acc&egrave;s, l'adresse IP reste 0.0.0.0. Cette adresse change sit&ocirc;t une connexion &eacute;tablie avec votre fournisseur d'acc&egrave;s Internet. Dans la bo&icirc;te d&eacute;roulante, vous pouvez aussi choisir l'adaptateur Ethernet associ&eacute; &agrave; <a href="#22">votre carte r&eacute;seau</a>. Dans ce cas, le num&eacute;ro IP que vous avez entr&eacute; pr&eacute;c&eacute;demment appara&icirc;t. Ce num&eacute;ro IP est fixe et vous servira pour les connexions autres que celles avec votre fournisseur d'acc&egrave;s.</p>
<p align="center"><img src="images/audela_reseau/winip3.jpg" height="240" width="363" /> </p>
<p>Dans la mesure o&ugrave; votre r&eacute;seau n'est pas reli&eacute; directement &agrave; l'internet (les onglets Passerelle et Configuration DNS du panneau Propri&eacute;t&eacute;s TCP/IP sont vides), votre adresse IP fixe concernera uniquement votre r&eacute;seau local. Vous pouvez aussi communiquer entre plusieurs logiciels Audela en utilisant le r&eacute;seau Internet, via votre fournisseur d'acc&egrave;s, mais dans ce cas, il faudra utiliser l'adresse IP correspondante &agrave; l'adaptateur PPP.</p>
<p>En r&eacute;sum&eacute;:</p>
<ul>
  <li> Pour communiquer entre deux logiciels Audela install&eacute;s dans un r&eacute;seau local (de type Maison-Jardin), on utilisera les adresses IP fixes.</li>
  <li> Pour communiquer entre deux logiciels Audela install&eacute;s sur des ordinateurs tr&egrave;s distants reli&eacute;s par Internet, via votre fournisseur d'acc&egrave;s, on utilisera l'adresse IP de l'adaptateur PPP. Le probl&egrave;me de cette m&eacute;thode est que cette adresse IP change &agrave; chaque connexion (ou tout les 24 heures dans le cas d'une connexion ADSL).</li>
  <li> Pour communiquer entre deux logiciels Audela install&eacute;s sur des ordinateurs tr&egrave;s distants reli&eacute;s par Internet, sans fournisseur d'acc&egrave;s, on utilisera l'adresse IP fixe. Dans ce cas, votre ordinateur devra faire partie d'un r&eacute;seau identifi&eacute; et d&eacute;clar&eacute; sur l'Internet (Passerelle et configuration DNS).</li>
</ul>
<h3> <a name="5"></a>6. Partage des disques</h3>
<p> La derni&egrave;re &eacute;tape de l'installation du r&eacute;seau consiste &agrave; partager les disques des diff&eacute;rents ordinateurs. Il faut d'abord sp&eacute;cifier au r&eacute;seau que l'on autorise le partage des disques. Pour cela, il faut ouvrir la fen&ecirc;tre du panneau de configuration (bouton D&eacute;marrer puis Param&egrave;tres et cliquer sur Panneau de configuration) puis ouvrir la fen&ecirc;tre de configuration du r&eacute;seau en cliquant sur l'ic&ocirc;ne<img src="images/audela_reseau/reseau1.jpg" height="59" width="56" />. La fen&ecirc;tre du r&eacute;seau pourrait ressembler &agrave; cela :</p>
<p align="center"><img src="images/audela_reseau/reseau5.jpg" height="460" width="367" /> </p>
<p>Cliquer sur le grand bouton "Partage de fichiers et d'imprimantes...". Il suffit alors de cocher les cases de la fen&ecirc;tre suivante et valider sur OK :</p>
<p align="center"><img src="images/audela_reseau/reseau11.jpg" height="101" width="423" /> </p>
<p>Partager un disque signifie que l'on autorise le r&eacute;seau &agrave; y avoir acc&egrave;s. Pour cela, on peut utiliser l'Explorateur de Windows. Il faut d'abord ouvrir la fen&ecirc;tre de l'explorateur (bouton D&eacute;marrer puis Programmes et cliquer sur Explorateur Windows) :</p>
<p align="center"><img src="images/audela_reseau/reseau7.jpg" height="345" width="308" /> </p>
<p>Dans la colonne de gauche, s&eacute;lectionner le disque que l'on d&eacute;sire partager, puis ouvrir le petit menu gris en cliquant sur le bouton droit de la souris. S&eacute;lectionner "Propri&eacute;t&eacute;s". Dans la fen&ecirc;tre des propri&eacute;t&eacute;s du disque (ou du dossier) s&eacute;lectionn&eacute;e, un onglet "Partage" permet d'acc&eacute;der &agrave; la page de partage :</p>
<p align="center"><img src="images/audela_reseau/reseau8.jpg" height="419" width="382" /> </p>
<p>Choisir l'option "Partag&eacute; en tant que" puis remplir les options selon sa convenance. Donner le Type d'acc&egrave;s complet pour permettre ainsi la lecture / &eacute;criture sur les disques partag&eacute;s. Appuyer sur le bouton OK pour valider le partage. Au retour dans la fen&ecirc;tre de l'explorateur, on constatera que l'ic&ocirc;ne du disque (ou du dossier) partag&eacute; repose sur une main<img src="images/audela_reseau/reseau9.jpg" height="14" width="20" />.</p>
<h3> <a name="pathlocal"></a>7. L'acc&egrave;s aux fichiers partag&eacute;s dans un r&eacute;seau local</h3>
<p>Les fonctions de lecture et d'&eacute;critures de fichiers peuvent utiliser les dossiers partag&eacute;s dans un r&eacute;seau local. De cette fa&ccedil;on, Windows nomme les chemins d'acc&egrave;s par le nom d'identification de l'ordinateur suivi du nom de partage de ses disques. Dans le cas utilis&eacute; dans cette page, on aura:</p>
<ul>
  <li> <a href="#identif">Identification de l'ordinateur</a> : Uranie</li>
  <li> <a href="#5">Nom de partage du disque C</a>: Rigel</li>
</ul>
<p>Le chemin d'acc&egrave;s du disque sur le r&eacute;seau se nomme //Uranie/Rigel au lieu de c: (ce qui &eacute;vite toute ambigu&iuml;t&eacute; car plusieurs ordinateurs du r&eacute;seau ont un disque c:). La notation // d&eacute;signe la racine du r&eacute;seau. Ainsi, peut-on lire une image &agrave; partir de n'importe quel ordinateur connect&eacute; au r&eacute;seau local. Par exemple avec Audela, la commande:</p>
<pre>buf1 load //Uranie/Rigel/images/m57.fit</pre>
<p>permet de lire l'image m57.fit enregistr&eacute;e dans le chemin c:\images de l'ordinateur Uranie, &agrave; partir de n'importe quel autre ordinateur appartenant au r&eacute;seau. Cette possibilit&eacute; est exploit&eacute;e par l'interface Audace avec le panneau de contr&ocirc;le &agrave; distance qui permet de lire le fichier et d'afficher l'image qui a &eacute;t&eacute; acquise avec l'ordinateur distant. </p>
</body>
</html>
